In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:easwari@localhost

In [3]:
%%sql
show databases;

 * mysql+pymysql://root:***@localhost
15 rows affected.

[('employees',),
 ('events',),
 ('functions',),
 ('information_schema',),
 ('joins',),
 ('mysql',),
 ('performance_schema',),
 ('sales',),
 ('set operations',),
 ('students',),
 ('subqueries',),
 ('sys',),
 ('triggers',),
 ('window functions interview questuions',),
 ('window_functions',)]

In [4]:
%%sql
use joins;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [5]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('departments',), ('employees',), ('salaries',)]

In [9]:
%%sql
create table `table1`(id int);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [10]:
%%sql
create table `table2`(id int);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [16]:
%%sql
insert into `table1` values(1),(2),(3);

 * mysql+pymysql://root:***@localhost
3 rows affected.

[]

In [17]:
%%sql
insert into `table2` values(1),(1),(1),(2),(2),(3),(3),(3),(4),(4);

 * mysql+pymysql://root:***@localhost
10 rows affected.

[]

In [18]:
%%sql
insert into `table1` values(null);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [19]:
%%sql
select * from `table1`;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[(1,), (2,), (3,), (None,)]

In [20]:
%%sql
select * from `table2`;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1,), (1,), (1,), (2,), (2,), (3,), (3,), (3,), (4,), (4,)]

In [21]:
%%sql
select a.*, b.*
from `table1` as a 
inner join `table2` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
8 rows affected.

[(1, 1), (1, 1), (1, 1), (2, 2), (2, 2), (3, 3), (3, 3), (3, 3)]

In [22]:
%%sql
select a.*, b.*
from `table1` as a 
left join `table2` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
9 rows affected.

[(1, 1), (1, 1), (1, 1), (2, 2), (2, 2), (3, 3), (3, 3), (3, 3), (None, None)]

In [23]:
%%sql
select a.*, b.*
from `table1` as a 
right join `table2` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 1),
 (1, 1),
 (1, 1),
 (2, 2),
 (2, 2),
 (3, 3),
 (3, 3),
 (3, 3),
 (None, 4),
 (None, 4)]

In [24]:
%%sql
select a.*, b.*
from `table1` as a 
left join `table2` as b
on a.id = b.id
union
select a.*, b.*
from `table1` as a 
right join `table2` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 1), (2, 2), (3, 3), (None, None), (None, 4)]

In [25]:
%%sql
create table `table-a`(id int);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [26]:
%%sql
create table `table-b`(id int);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [27]:
%%sql
insert into `table-a` values(1),(1),(1),(2),(2),(3),(5);

 * mysql+pymysql://root:***@localhost
7 rows affected.

[]

In [28]:
%%sql
insert into `table-b` values(1),(1),(2),(3),(4),(null);

 * mysql+pymysql://root:***@localhost
6 rows affected.

[]

In [29]:
%%sql
select * from `table-a`;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1,), (1,), (1,), (2,), (2,), (3,), (5,)]

In [30]:
%%sql
select * from `table-b`;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1,), (1,), (2,), (3,), (4,), (None,)]

In [31]:
%%sql
select a.*, b.*
from `table-a` as a 
inner join `table-b` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
9 rows affected.

[(1, 1), (1, 1), (1, 1), (1, 1), (1, 1), (1, 1), (2, 2), (2, 2), (3, 3)]

In [32]:
%%sql
select a.*, b.*
from `table-a` as a 
left join `table-b` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(1, 1),
 (1, 1),
 (1, 1),
 (1, 1),
 (1, 1),
 (1, 1),
 (2, 2),
 (2, 2),
 (3, 3),
 (5, None)]

In [33]:
%%sql
select a.*, b.*
from `table-a` as a 
right join `table-b` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
11 rows affected.

[(1, 1),
 (1, 1),
 (1, 1),
 (1, 1),
 (1, 1),
 (1, 1),
 (2, 2),
 (2, 2),
 (3, 3),
 (None, 4),
 (None, None)]

In [34]:
%%sql
select a.*, b.*
from `table-a` as a 
left join `table-b` as b
on a.id = b.id
union
select a.*, b.*
from `table-a` as a 
right join `table-b` as b
on a.id = b.id;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(1, 1), (2, 2), (3, 3), (5, None), (None, 4), (None, None)]